In [1]:
import pandas as pd
pd.Series([7, 3, 5, 8])

0    7
1    3
2    5
3    8
dtype: int64

In [6]:
x = pd.Series([7, 3, 5, 8], index=['서울', '대구', '부산', '광주'])

x['서울']

7

In [5]:
x[['서울', '대구']]

서울    7
대구    3
dtype: int64

In [11]:
type(x)

pandas.core.series.Series

In [12]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [13]:
print(sorted(x.index))

['광주', '대구', '부산', '서울']

In [17]:
sorted(x.values)

[3, 5, 7, 8]

In [18]:
x= x.reindex(sorted(x.index))

In [19]:
x

광주    8
대구    3
부산    5
서울    7
dtype: int64

In [21]:
x = pd.Series([3, 8, 5, 9], index = ['서울', '대구', '부산', '광주'])
y = pd.Series([2, 4, 5 ,1], index = ['대구', '부산', '서울', '대전'])
x+y

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [22]:
medal = [1, 3, 2, 4, 2, 3]
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [40]:
ary = [[1,2], [3,4], [5,6], [7,8], [9,10]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
data.iloc[0]

First     1
Second    2
Name: 0, dtype: int64

In [35]:
data.iloc[1]

First     3
Second    4
Name: 1, dtype: int64

In [38]:
data.iloc[:, 1]

0    2
1    4
2    6
Name: Second, dtype: int64

In [46]:
data.head()

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

In [48]:
data.tail(3)

   First  Second
2      5       6
3      7       8
4      9      10

In [54]:
bools = [False, True, True, False, True]
data.Second[bools]

1     4
2     6
4    10
Name: Second, dtype: int64

In [57]:
ary = [[1,2], [3,4], [5,6], [7,8], [9,10]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
bools = [False, True, True, False, True]
data[bools]

   First  Second
1      3       4
2      5       6
4      9      10

In [60]:
print(x.mean(axis=0))

age        30.750
height    173.525
dtype: float64

In [62]:
data = {'age' : [60, 55, 35, 24],
        'name': ['용우', '경옥', '하나', '도훈'],
        'height' : [173.3, 158.3, 168.8, 182.5]}
x = pd.DataFrame(data, columns = ['name', 'age', 'height'])

In [63]:
x

  name  age  height
0   용우   60   173.3
1   경옥   55   158.3
2   하나   35   168.8
3   도훈   24   182.5

In [74]:
x.age

0    60
1    55
2    35
3    24
Name: age, dtype: int64

In [78]:
x.iloc[0]

name         용우
age          60
height    173.3
Name: 0, dtype: object

In [84]:
x.iloc[0,1]

60

In [85]:
print(x.mean(axis=0))

age        43.500
height    170.725
dtype: float64